TODO_FILE = "spravy.txt"

def show_tasks():
    """ВиводитЬ усі справи з файлу. """
    try:
        with open(TODO_FILE, 'r', encoding='utf-8') as file:
            tasks = file.readlines()
    except FileNotFoundError:
        print("⚠️Файл справ ще не існує. Справ немає!")
        return
    if not tasks:
        print("🥳Список справ пустий! Ти вільний!")
    else:
        print("\n📃 ТВОЇ СПРАВИ HA сьогоднІ")
        for i, task in enumerate(tasks,1):
            print(f"{i}. {task.strip()}")
        print("-" * 25)


def add_task():
    """Додає нову справу в кінець файлу (режим 'а'). """
    new_task = input("Яку справу додати до списку? (Наприклад: Погуляти з собакою): ")
    if new_task:
        with open(TODO_FILE, 'a', encoding='utf-8') as file:
            file.write(new_task + "\n")
        print(f" ✅Справу '{new_task}' додано!")
    else:
        print("🛑Ти нічого не ввів. Справа не додана.")



def clear_tasks():
    """Очищає вміст файлу (записує пустий рядок, режим 'w')."""
    if os.path.exists(TODO_FILE):
        confirm = input("УВАГА! Ти справді хочеш ОЧИСТИТИ BCI СПРАВИ? (так/ні): ").lower()
        if confirm == 'yes':
            with open(TODO_FILE, 'w', encoding='utf-8') as file:
                file.write("")
            print("Всі справи успішно видалено! (Файл очищено).")
        else:
            print("Очищення скасовано.")
    else:
        print("Файл справ не існує, нема чого очищати.")


def todo_list_app():
    """Головна функція програми Обліку Справ."""
    print("\n* ПРОГРАМА ОБЛІКУ СПРАВ (TO-DO LIST)")
    while True:
        print("\n---Menue---")
        print("1 - Показати всі справи")
        print("2 - Додати нову справу")
        print("3 - Очистити всі справи")
        print("4 - Вийти з програми")

        choice = input("Обери дію (1-4): ")

        if choice == '1':
            show_tasks()
        elif choice == '2':
            add_task()
        elif choice == '3':
            clear_tasks()
        elif choice == '4':
            print("Дякую за використання програми! До зустрічі.")
            break
        else:
            print("Невірний вибір. Спробуй ще раз (1, 2, 3, або 4).")
     
if  __name__=="__main__":

    todo_list_app()